Revit 2027 API
ParameterTypeId.StairsAttrTreadFrontProfile Property
 "Nosing Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsAttrTreadFrontProfile { get; }
Public Shared ReadOnly Property StairsAttrTreadFrontProfile As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsAttrTreadFrontProfile {
	ForgeTypeId^ get ();
}
static member StairsAttrTreadFrontProfile : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace